Ran Plan for dir: `_infra` workspace: `default`

<details><summary>Show Output</summary>

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_bucket.b has been changed
~ resource "aws_s3_bucket" "b" {
        id                          = "test"
      + tags                        = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_bucket.b must be replaced
-/+ resource "aws_s3_bucket" "b" {
      + acceleration_status         = (known after apply)
      ~ arn                         = "arn:aws:s3:::test" -> (known after apply)
      ~ bucket                      = "test" -> "mybucket" # forces replacement
      ~ bucket_domain_name          = "test.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "test.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "test" -> (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
      - tags                        = {} -> null
      ~ tags_all                    = {} -> (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      ~ versioning {
          ~ enabled    = false -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Warning: Empty provider configuration blocks are not required

  on modules/app/app.tf line 10:
  10: provider "docker" {}

Remove the docker provider block from module.app1.

(and one more similar warning elsewhere)
2021/11/25 18:07:58 [DEBUG] DELETE http://localhost:8000/api/v1/project/12345/terraform/state/unlock/terraform.lock

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d _infra`
* :put_litter_in_its_place: To **delete** this plan click [here](https://6990-2a02-c7e-2c31-4b00-845-9d36-e82f-3c76.ngrok.io/lock?id=nassergonzalez%252Finfra-test%252F_infra%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d _infra`
</details>

**Note: Objects have changed outside of Terraform**
Plan: 1 to add, 0 to change, 1 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
